{
    "FormatVersion": 2,
    "Namespace": "",
    "Children": [
        {
            "Source": {
                "Text": "1× Assembler · 2.5/min of 12.5 needed"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "AB46CACF4C402D0A0C2BBD8FB7B2500A"
        },
        {
            "Source": {
                "Text": "1× Manufacturer · 2.5/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3AE89A3A41716D0C1158828D998F52A4"
        },
        {
            "Source": {
                "Text": "2,000 needed  ·  2,000 banked  ·  deliver now"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "650C25414036AC525E39C79183343F3B"
        },
        {
            "Source": {
                "Text": "2× Assembler · 25/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "FE02FE6043275C5F429266A6F006A805"
        },
        {
            "Source": {
                "Text": "2× Manufacturer · 5.0/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "9614FDD644BF8B9EE29DE8A6D6732B2C"
        },
        {
            "Source": {
                "Text": "3 parts required  ·  1 ready to deliver  ·  1 blocked  ·  earliest completion ~72 min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "7F101E664166DBC1D99692B19B5313F2"
        },
        {
            "Source": {
                "Text": "480 needed  ·  120 banked  ·  360 to produce  ·  ~72 min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "E8ACA03D49EB7261E197659531E32B6F"
        },
        {
            "Source": {
                "Text": "99 needed  ·  7 banked  ·  92 to produce  ·  blocked"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3BE554254D343A7BBCA2B7B5A00AF90C"
        },
        {
            "Source": {
                "Text": "Adaptive Control Unit"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "08EBECCB41804E37453A4AAA1FD5F3E3"
        },
        {
            "Source": {
                "Text": "Automated Wiring"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "9EF74FE34AE569C38CA64E9D82C844A8"
        },
        {
            "Source": {
                "Text": "CRITICAL PATH"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "043B5BBC45C8B0568744889832C5FD6B"
        },
        {
            "Source": {
                "Text": "Modular Engine"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "E3B96B684DA94C6196E53B9E5EF65A3E"
        },
        {
            "Source": {
                "Text": "Space Elevator: Main Body"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "2523207949D893471F1C63BF2314EACE"
        },
        {
            "Source": {
                "Text": "Stator"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "F616D3404E39FA0AE068C5AD74FA8243"
        },
        {
            "Source": {
                "Text": "Versatile Framework"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "73F3C0684140FD63EC7EBF898F7BE8AD"
        },
        {
            "Source": {
                "Text": "no producer configured"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "B4DE02E8428694AE136D48822BF08AE1"
        },
        {
            "Source": {
                "Text": "×"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "1A0751FB44AC4366F8DF2BBCAF1BFF20"
        },
        {
            "Source": {
                "Text": "× BLOCKED — Adaptive Control Unit is stalled. Build a Stator line: it gates Automated Wiring → Adaptive Control Unit → Main Body."
            },
            "Translation": {
                "Text": ""
            },
            "Key": "C00C970340D208F8A377D2B6647BE15D"
        },
        {
            "Source": {
                "Text": "■"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "916D7FF44FD10ADF39543CA075B7F49A"
        },
        {
            "Source": {
                "Text": "▲"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "B93CDE3745A0108F118915A3EB4B3B18"
        },
        {
            "Source": {
                "Text": "▲"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3D920FAE42B1D930C642E6933107B5CB"
        },
        {
            "Source": {
                "Text": "●"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "29308E89411226D839FFDD9CFE508DF0"
        }
    ],
    "Subnamespaces": [
        {
            "Namespace": "CriticalPath",
            "Children": [
                {
                    "Source": {
                        "Text": "  ·  nearest endpoint {0} m away"
                    },
                    "Translation": {
                        "Text": "  ·  أقرب طرف على بُعد {0} م"
                    },
                    "Key": "BalanceDistanceFmt"
                },
                {
                    "Source": {
                        "Text": "ALL AUGMENTS"
                    },
                    "Translation": {
                        "Text": "كل المعززات"
                    },
                    "Key": "BalanceAugmentAll"
                },
                {
                    "Source": {
                        "Text": "ALL LINES"
                    },
                    "Translation": {
                        "Text": "كل الخطوط"
                    },
                    "Key": "BalanceProblemAll"
                },
                {
                    "Source": {
                        "Text": "AT FULL SPEED  needs {0}  ·  ingredients allow {1}  ·  would deliver {2}"
                    },
                    "Translation": {
                        "Text": "بالسرعة القصوى  يحتاج {0}  ·  المكوّنات تسمح بـ {1}  ·  سيسلّم {2}"
                    },
                    "Key": "BalanceDesignFmt"
                },
                {
                    "Source": {
                        "Text": "AWESOME Shop"
                    },
                    "Translation": {
                        "Text": "AWESOME Shop"
                    },
                    "Key": "SrcShop"
                },
                {
                    "Source": {
                        "Text": "Across the whole factory only {0}/min is available against {1}/min needed ({2}%) - this may be a different line"
                    },
                    "Translation": {
                        "Text": "في المصنع بأكمله يتوفر {0}/دقيقة فقط مقابل {1}/دقيقة مطلوبة ({2}%) - قد يكون هذا خطًا آخر"
                    },
                    "Key": "LimiterNetFmt"
                },
                {
                    "Source": {
                        "Text": "Already produced"
                    },
                    "Translation": {
                        "Text": "أُنتج بالفعل"
                    },
                    "Key": "PlanGraft"
                },
                {
                    "Source": {
                        "Text": "Already produced - {0}"
                    },
                    "Translation": {
                        "Text": "أُنتج بالفعل - {0}"
                    },
                    "Key": "PlanGraftFmt"
                },
                {
                    "Source": {
                        "Text": "Arriving ingredients only support {0} of the {1} these machines could make"
                    },
                    "Translation": {
                        "Text": "المكوّنات الواصلة تكفي لـ {0} فقط من {1} يمكن لهذه الآلات إنتاجها"
                    },
                    "Key": "LimiterInputConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Asking the host for a report"
                    },
                    "Translation": {
                        "Text": "جارٍ طلب تقرير من المضيف"
                    },
                    "Key": "AskingHostHeadline"
                },
                {
                    "Source": {
                        "Text": "Assumed recipe: {0}"
                    },
                    "Translation": {
                        "Text": "الوصفة المفترضة: {0}"
                    },
                    "Key": "PlanTipFmt"
                },
                {
                    "Source": {
                        "Text": "A–Z"
                    },
                    "Translation": {
                        "Text": "A–Z"
                    },
                    "Key": "BalanceSortAlphabetical"
                },
                {
                    "Source": {
                        "Text": "BALANCE"
                    },
                    "Translation": {
                        "Text": "التوازن"
                    },
                    "Key": "TabBalance"
                },
                {
                    "Source": {
                        "Text": "BELT JAMMED · {0} machine(s) blocked by {1} on the feeding belt - remove it; this is not a supply shortage"
                    },
                    "Translation": {
                        "Text": "انحشار الناقل · {0} آلة/آلات محجوبة بـ {1} على الناقل المغذّي - أزِله؛ هذا ليس نقص إمداد"
                    },
                    "Key": "BalanceJammedFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - the plan ({0} step(s)):"
                    },
                    "Translation": {
                        "Text": "محجوب - الخطة ({0} خطوة/خطوات):"
                    },
                    "Key": "VerdictPlanBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - {0} step(s) to deliver {1}"
                    },
                    "Translation": {
                        "Text": "محجوب - {0} خطوة/خطوات لتسليم {1}"
                    },
                    "Key": "VerdictPlanBlockedDeliverFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - {0}: {1}."
                    },
                    "Translation": {
                        "Text": "محجوب - {0}: {1}."
                    },
                    "Key": "VerdictBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "BUFFER  {0} {1} reachable"
                    },
                    "Translation": {
                        "Text": "المخزون  {0} {1} متاح"
                    },
                    "Key": "BufferAmountFmt"
                },
                {
                    "Source": {
                        "Text": "BUFFER  {0} {1} reachable  ·  about {2} min at the current shortfall"
                    },
                    "Translation": {
                        "Text": "المخزون  {0} {1} متاح  ·  نحو {2} دقيقة بمعدل النقص الحالي"
                    },
                    "Key": "BufferRunwayFmt"
                },
                {
                    "Source": {
                        "Text": "BUILT CAPACITY"
                    },
                    "Translation": {
                        "Text": "الطاقة المبنية"
                    },
                    "Key": "BalanceInstalled"
                },
                {
                    "Source": {
                        "Text": "Belt bottleneck: {0} → {1} carries {2} of {3}"
                    },
                    "Translation": {
                        "Text": "اختناق في الناقل: {0} → {1} ينقل {2} من {3}"
                    },
                    "Key": "LimiterBeltConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Bottleneck: {0}"
                    },
                    "Translation": {
                        "Text": "الاختناق: {0}"
                    },
                    "Key": "LimiterNameFmt"
                },
                {
                    "Source": {
                        "Text": "CLEAR PINGS"
                    },
                    "Translation": {
                        "Text": "مسح العلامات"
                    },
                    "Key": "ClearPings"
                },
                {
                    "Source": {
                        "Text": "COLLECTED IN THE WORLD · no machine makes this; {0} is drawn from what you carry in and store"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceWorldGatheredFmt"
                },
                {
                    "Source": {
                        "Text": "CONSUMER NEED"
                    },
                    "Translation": {
                        "Text": "حاجة المستهلكين"
                    },
                    "Key": "BalanceDemand"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS"
                    },
                    "Translation": {
                        "Text": "المستهلكون"
                    },
                    "Key": "BalanceConsumersHeading"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but none of them are running"
                    },
                    "Translation": {
                        "Text": "المستهلكات متوقفة · {0} آلة هنا كانت ستستخدم {1}، لكن لا يعمل أي منها"
                    },
                    "Key": "BalanceConsumersStoppedFmt"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but their own output is backed up"
                    },
                    "Translation": {
                        "Text": "المستهلكات متوقفة · {0} آلة هنا كانت ستستخدم {1}، لكن مخرجها الخاص ممتلئ"
                    },
                    "Key": "BalanceConsumersBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "CRITICAL PATH"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "PanelTitle"
                },
                {
                    "Source": {
                        "Text": "Checking your factory…"
                    },
                    "Translation": {
                        "Text": "جارٍ فحص مصنعك…"
                    },
                    "Key": "BalancePending"
                },
                {
                    "Source": {
                        "Text": "Click to show/hide the blocker chain"
                    },
                    "Translation": {
                        "Text": "انقر لإظهار/إخفاء سلسلة العوائق"
                    },
                    "Key": "TipChainHint"
                },
                {
                    "Source": {
                        "Text": "Could not measure what is arriving - check the belts and pipes feeding this"
                    },
                    "Translation": {
                        "Text": "تعذّر قياس ما يصل - افحص النواقل والأنابيب المغذّية لهذا"
                    },
                    "Key": "BlockSolvedConnectivityUnknown"
                },
                {
                    "Source": {
                        "Text": "Critical Path could not find a player to ask the host on behalf of."
                    },
                    "Translation": {
                        "Text": "تعذّر على Critical Path العثور على لاعب يُطلب التقرير من المضيف نيابةً عنه."
                    },
                    "Key": "NoControllerDetail"
                },
                {
                    "Source": {
                        "Text": "Current milestone is fully paid - collect it and select the next one at the HUB."
                    },
                    "Translation": {
                        "Text": "المعلم الحالي مدفوع بالكامل - استلمه واختر التالي من HUB."
                    },
                    "Key": "MilestonePaid"
                },
                {
                    "Source": {
                        "Text": "DRAWN FROM STORAGE · nothing is making this; the {0} you have banked covers about {1} min at this rate"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceStockedByHandRunwayFmt"
                },
                {
                    "Source": {
                        "Text": "DRAWN FROM STORAGE · nothing is making this; {0} banked is all there is"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceStockedByHandFmt"
                },
                {
                    "Source": {
                        "Text": "Delivered"
                    },
                    "Translation": {
                        "Text": "تم التسليم"
                    },
                    "Key": "StatusDelivered"
                },
                {
                    "Source": {
                        "Text": "Delivered: all {0}"
                    },
                    "Translation": {
                        "Text": "تم التسليم: كل {0}"
                    },
                    "Key": "TipDeliveredFmt"
                },
                {
                    "Source": {
                        "Text": "Delivery rates are not available right now. Machine status and built capacity are shown below."
                    },
                    "Translation": {
                        "Text": "معدلات التسليم غير متاحة حاليًا. تظهر أدناه حالة الآلات والطاقة المبنية."
                    },
                    "Key": "BalanceUnknown"
                },
                {
                    "Source": {
                        "Text": "EST. CURRENT OUTPUT"
                    },
                    "Translation": {
                        "Text": "تقدير الإنتاج الحالي"
                    },
                    "Key": "BalanceEstimatedOutput"
                },
                {
                    "Source": {
                        "Text": "EST. CURRENT USE"
                    },
                    "Translation": {
                        "Text": "تقدير الاستهلاك الحالي"
                    },
                    "Key": "BalanceEstimatedUse"
                },
                {
                    "Source": {
                        "Text": "Elevator"
                    },
                    "Translation": {
                        "Text": "المصعد"
                    },
                    "Key": "SectionElevatorNone"
                },
                {
                    "Source": {
                        "Text": "Elevator: {0}"
                    },
                    "Translation": {
                        "Text": "المصعد: {0}"
                    },
                    "Key": "SectionElevatorFmt"
                },
                {
                    "Source": {
                        "Text": "Every line feeding your objective: what it makes, what arrives, and how long your stock lasts."
                    },
                    "Translation": {
                        "Text": "كل خط يغذّي هدفك: ما ينتجه، وما يصل منه، ومدة بقاء مخزونك."
                    },
                    "Key": "BalanceIntro"
                },
                {
                    "Source": {
                        "Text": "Extraction {0}/min vs demand {1}/min - add or upgrade extractors"
                    },
                    "Translation": {
                        "Text": "الاستخراج {0}/دقيقة مقابل طلب {1}/دقيقة - أضِف مستخرجات أو طوّرها"
                    },
                    "Key": "BlockExtractFmt"
                },
                {
                    "Source": {
                        "Text": "HUB"
                    },
                    "Translation": {
                        "Text": "HUB"
                    },
                    "Key": "SrcTutorial"
                },
                {
                    "Source": {
                        "Text": "It is being made, but no belt or pipe connects it to what needs it"
                    },
                    "Translation": {
                        "Text": "يتم إنتاجه، لكن لا يوجد ناقل أو أنبوب يوصله إلى ما يحتاجه"
                    },
                    "Key": "BlockNotConnected"
                },
                {
                    "Source": {
                        "Text": "JAMMED"
                    },
                    "Translation": {
                        "Text": "انحشار"
                    },
                    "Key": "BalanceProblemJammed"
                },
                {
                    "Source": {
                        "Text": "LOCATE"
                    },
                    "Translation": {
                        "Text": "تحديد الموقع"
                    },
                    "Key": "LocateEndpoint"
                },
                {
                    "Source": {
                        "Text": "LOCATE CONSUMER"
                    },
                    "Translation": {
                        "Text": "تحديد موقع المستهلك"
                    },
                    "Key": "LocateConsumer"
                },
                {
                    "Source": {
                        "Text": "LOCATE PRODUCER"
                    },
                    "Translation": {
                        "Text": "تحديد موقع المنتج"
                    },
                    "Key": "LocateProducer"
                },
                {
                    "Source": {
                        "Text": "Line exists but is STOPPED - fix it"
                    },
                    "Translation": {
                        "Text": "الخط موجود لكنه متوقف - أصلحه"
                    },
                    "Key": "PlanGraftStopped"
                },
                {
                    "Source": {
                        "Text": "Line exists but is STOPPED - fix the {0}"
                    },
                    "Translation": {
                        "Text": "الخط موجود لكنه متوقف - أصلح {0}"
                    },
                    "Key": "PlanGraftStoppedFmt"
                },
                {
                    "Source": {
                        "Text": "MACHINE STATUS ONLY · delivery rates are not available right now"
                    },
                    "Translation": {
                        "Text": "حالة الآلات فقط · معدلات التسليم غير متاحة حاليًا"
                    },
                    "Key": "BalancePartialEvidence"
                },
                {
                    "Source": {
                        "Text": "MACHINES RUNNING SLOW · using about {0} of {1}; {2} machine(s) are short of ingredients"
                    },
                    "Translation": {
                        "Text": "الآلات تعمل ببطء · تستهلك نحو {0} من {1}؛ {2} آلة/آلات تنقصها المكوّنات"
                    },
                    "Key": "BalanceObservedUseGapFmt"
                },
                {
                    "Source": {
                        "Text": "MAM"
                    },
                    "Translation": {
                        "Text": "MAM"
                    },
                    "Key": "SrcMAM"
                },
                {
                    "Source": {
                        "Text": "MISSING INPUT"
                    },
                    "Translation": {
                        "Text": "مدخل مفقود"
                    },
                    "Key": "BalanceProblemStarved"
                },
                {
                    "Source": {
                        "Text": "Machine contents and storage are tracked by the host, so Critical Path is requesting the report from there. This can take a few seconds on a large factory."
                    },
                    "Translation": {
                        "Text": "يتتبّع المضيف محتويات الآلات والمخازن، لذا يطلب Critical Path التقرير من هناك. قد يستغرق ذلك بضع ثوانٍ في المصانع الكبيرة."
                    },
                    "Key": "AskingHostDetail"
                },
                {
                    "Source": {
                        "Text": "Machines here can make {0}; the machines using it need {1}"
                    },
                    "Translation": {
                        "Text": "يمكن للآلات هنا إنتاج {0}؛ والآلات المستهلكة تحتاج {1}"
                    },
                    "Key": "LimiterInstalledConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Milestone"
                    },
                    "Translation": {
                        "Text": "المعلم"
                    },
                    "Key": "SectionMilestoneNone"
                },
                {
                    "Source": {
                        "Text": "Milestone: {0}"
                    },
                    "Translation": {
                        "Text": "المعلم: {0}"
                    },
                    "Key": "SectionMilestoneFmt"
                },
                {
                    "Source": {
                        "Text": "NEED FIRST"
                    },
                    "Translation": {
                        "Text": "الحاجة أولًا"
                    },
                    "Key": "BalanceSortNeedFirst"
                },
                {
                    "Source": {
                        "Text": "NEEDS ATTENTION"
                    },
                    "Translation": {
                        "Text": "يتطلب انتباهًا"
                    },
                    "Key": "BalanceProblemAttention"
                },
                {
                    "Source": {
                        "Text": "NEXT - {0}: {1}."
                    },
                    "Translation": {
                        "Text": "التالي - {0}: {1}."
                    },
                    "Key": "VerdictNextFmt"
                },
                {
                    "Source": {
                        "Text": "NEXT STEPS - the plan ({0} step(s)):"
                    },
                    "Translation": {
                        "Text": "الخطوات التالية - الخطة ({0} خطوة/خطوات):"
                    },
                    "Key": "VerdictPlanHeadFmt"
                },
                {
                    "Source": {
                        "Text": "NEXT STEPS - {0} step(s) to deliver {1}"
                    },
                    "Translation": {
                        "Text": "الخطوات التالية - {0} خطوة/خطوات لتسليم {1}"
                    },
                    "Key": "VerdictPlanDeliverFmt"
                },
                {
                    "Source": {
                        "Text": "NO POWER"
                    },
                    "Translation": {
                        "Text": "لا طاقة"
                    },
                    "Key": "BalanceProblemNoPower"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH ARRIVING · {0} is getting through; {1} is needed"
                    },
                    "Translation": {
                        "Text": "الوارد غير كافٍ · يصل {0}؛ والمطلوب {1}"
                    },
                    "Key": "BalanceModeledDeliveryGapFmt"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH MACHINES · build at least {0} more production"
                    },
                    "Translation": {
                        "Text": "الآلات غير كافية · ابنِ إنتاجًا إضافيًا بمقدار {0} على الأقل"
                    },
                    "Key": "BalanceCapacityGapFmt"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH MACHINES · {0} short, and some machines are stopped as well"
                    },
                    "Translation": {
                        "Text": "الآلات غير كافية · نقص {0}، وبعض الآلات متوقفة أيضًا"
                    },
                    "Key": "BalanceCapacityMachineGapsFmt"
                },
                {
                    "Source": {
                        "Text": "NOT REACHING THE MACHINES · {0} producer(s) backed up while {1} consumer(s) sit starved - this is routing, not capacity"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceDistributionFmt"
                },
                {
                    "Source": {
                        "Text": "NOTHING IS USING THIS · it is only filling storage right now"
                    },
                    "Translation": {
                        "Text": "لا شيء يستهلك هذا · إنه يملأ المخزن فقط حاليًا"
                    },
                    "Key": "BalanceNoDemand"
                },
                {
                    "Source": {
                        "Text": "Needs a fix"
                    },
                    "Translation": {
                        "Text": "يحتاج إصلاحًا"
                    },
                    "Key": "StatusNeedsFix"
                },
                {
                    "Source": {
                        "Text": "No balance rows match this filter."
                    },
                    "Translation": {
                        "Text": "لا توجد صفوف توازن تطابق هذا المرشّح."
                    },
                    "Key": "BalanceNoMatches"
                },
                {
                    "Source": {
                        "Text": "No inputs arriving (check connections and supply)"
                    },
                    "Translation": {
                        "Text": "لا مدخلات واصلة (افحص التوصيلات والإمداد)"
                    },
                    "Key": "BlockInputsStarved"
                },
                {
                    "Source": {
                        "Text": "No inputs arriving - {0} of {1} machine(s) starved (check connections and supply)"
                    },
                    "Translation": {
                        "Text": "لا مدخلات واصلة - {0} من {1} آلة/آلات بلا تغذية (افحص التوصيلات والإمداد)"
                    },
                    "Key": "BlockInputsStarvedFmt"
                },
                {
                    "Source": {
                        "Text": "No known source"
                    },
                    "Translation": {
                        "Text": "لا مصدر معروف"
                    },
                    "Key": "PlanUnknown"
                },
                {
                    "Source": {
                        "Text": "No line - build one"
                    },
                    "Translation": {
                        "Text": "لا يوجد خط - ابنِ واحدًا"
                    },
                    "Key": "PlanLine"
                },
                {
                    "Source": {
                        "Text": "No line - build: {0}"
                    },
                    "Translation": {
                        "Text": "لا يوجد خط - ابنِ: {0}"
                    },
                    "Key": "PlanLineFmt"
                },
                {
                    "Source": {
                        "Text": "No line feeding your objective is in this state ({0}). Nothing to fix here."
                    },
                    "Translation": {
                        "Text": "لا يوجد خط يغذّي هدفك في هذه الحالة ({0}). لا شيء لإصلاحه هنا."
                    },
                    "Key": "BalanceNoProblemMatches"
                },
                {
                    "Source": {
                        "Text": "No line feeding your objective matches this filter."
                    },
                    "Translation": {
                        "Text": "لا يوجد خط يغذّي هدفك يطابق هذا المرشّح."
                    },
                    "Key": "BalanceNoMatchesSearch"
                },
                {
                    "Source": {
                        "Text": "No machine can make this - you collect it out in the world and carry it back"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BlockWorldGathered"
                },
                {
                    "Source": {
                        "Text": "No milestone selected - {0} available. Choose one at the HUB."
                    },
                    "Translation": {
                        "Text": "لم يُحدّد أي معلم - {0} متاح. اختر واحدًا من HUB."
                    },
                    "Key": "MilestoneNoneSelectedFmt"
                },
                {
                    "Source": {
                        "Text": "No milestones available in this elevator phase."
                    },
                    "Translation": {
                        "Text": "لا توجد معالم متاحة في مرحلة المصعد هذه."
                    },
                    "Key": "MilestoneNoneAvailable"
                },
                {
                    "Source": {
                        "Text": "No outstanding Space Elevator phase."
                    },
                    "Translation": {
                        "Text": "لا توجد مرحلة معلّقة لمصعد الفضاء."
                    },
                    "Key": "ElevatorNone"
                },
                {
                    "Source": {
                        "Text": "No outstanding objectives."
                    },
                    "Translation": {
                        "Text": "لا توجد أهداف معلّقة."
                    },
                    "Key": "VerdictNone"
                },
                {
                    "Source": {
                        "Text": "No power - {0} of {1} machine(s) dark"
                    },
                    "Translation": {
                        "Text": "لا طاقة - {0} من {1} آلة/آلات بلا كهرباء"
                    },
                    "Key": "BlockNoPowerCountFmt"
                },
                {
                    "Source": {
                        "Text": "No recipe by design - spent fuel: burn {0} in a Nuclear Power Plant"
                    },
                    "Translation": {
                        "Text": "لا وصفة بحكم التصميم - وقود مستهلك: احرق {0} في محطة طاقة نووية"
                    },
                    "Key": "GapSpentFuelFmt"
                },
                {
                    "Source": {
                        "Text": "Not built yet"
                    },
                    "Translation": {
                        "Text": "لم يُبنَ بعد"
                    },
                    "Key": "StatusNotBuiltDefault"
                },
                {
                    "Source": {
                        "Text": "Not built yet"
                    },
                    "Translation": {
                        "Text": "لم يُبنَ بعد"
                    },
                    "Key": "StatusNotBuilt"
                },
                {
                    "Source": {
                        "Text": "Not connected to a game"
                    },
                    "Translation": {
                        "Text": "غير متصل بأي لعبة"
                    },
                    "Key": "NoControllerHeadline"
                },
                {
                    "Source": {
                        "Text": "Nothing on your objective path has a production line yet."
                    },
                    "Translation": {
                        "Text": "لا شيء على مسار هدفك لديه خط إنتاج بعد."
                    },
                    "Key": "BalanceEmpty"
                },
                {
                    "Source": {
                        "Text": "Nothing produces it - build a line"
                    },
                    "Translation": {
                        "Text": "لا شيء ينتجه - ابنِ خطًا"
                    },
                    "Key": "BlockNoProducer"
                },
                {
                    "Source": {
                        "Text": "ON TRACK - ~{0} min of production remain ({1} is the long pole)."
                    },
                    "Translation": {
                        "Text": "ضمن المسار - يتبقّى نحو {0} دقيقة من الإنتاج ({1} هو العنصر الأبطأ)."
                    },
                    "Key": "VerdictEtaFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is available for {1}/min needed ({2}%); some delivery routes could not be checked"
                    },
                    "Translation": {
                        "Text": "يتوفر {0}/دقيقة فقط مقابل {1}/دقيقة مطلوبة ({2}%)؛ تعذّر فحص بعض مسارات التسليم"
                    },
                    "Key": "LimiterAggFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is getting through; the machines on this line need {1}/min ({2}%)"
                    },
                    "Translation": {
                        "Text": "يصل {0}/دقيقة فقط؛ وآلات هذا الخط تحتاج {1}/دقيقة ({2}%)"
                    },
                    "Key": "LimiterSolvedFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is reaching this line; it needs {1}/min"
                    },
                    "Translation": {
                        "Text": "يصل {0}/دقيقة فقط إلى هذا الخط؛ وهو يحتاج {1}/دقيقة"
                    },
                    "Key": "BlockSolvedSupplyFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is reaching this line; it needs {1}/min - add or upgrade extraction"
                    },
                    "Translation": {
                        "Text": "يصل {0}/دقيقة فقط إلى هذا الخط؛ وهو يحتاج {1}/دقيقة - أضِف استخراجًا أو طوّره"
                    },
                    "Key": "BlockSolvedExtractFmt"
                },
                {
                    "Source": {
                        "Text": "Outputs full"
                    },
                    "Translation": {
                        "Text": "المخارج ممتلئة"
                    },
                    "Key": "BlockOutputsFull"
                },
                {
                    "Source": {
                        "Text": "Outputs full - {0} has no connected destination and may be backing up (check its disposal)"
                    },
                    "Translation": {
                        "Text": "المخارج ممتلئة - {0} بلا وجهة متصلة وقد يتراكم (افحص طريقة التخلص منه)"
                    },
                    "Key": "BlockByproductFmt"
                },
                {
                    "Source": {
                        "Text": "Outputs full - {0} of {1} machine(s) stalled"
                    },
                    "Translation": {
                        "Text": "المخارج ممتلئة - {0} من {1} آلة/آلات متوقفة"
                    },
                    "Key": "BlockOutputsFullFmt"
                },
                {
                    "Source": {
                        "Text": "Owned: {0} in storage  ·  {1} in depot  ·  {2} carried"
                    },
                    "Translation": {
                        "Text": "المملوك: {0} في المخزن  ·  {1} في المستودع  ·  {2} محمول"
                    },
                    "Key": "TipOwnedFmt"
                },
                {
                    "Source": {
                        "Text": "PATH"
                    },
                    "Translation": {
                        "Text": "المسار"
                    },
                    "Key": "TabPath"
                },
                {
                    "Source": {
                        "Text": "PAUSED"
                    },
                    "Translation": {
                        "Text": "متوقف مؤقتًا"
                    },
                    "Key": "BalanceProblemPaused"
                },
                {
                    "Source": {
                        "Text": "PLAN"
                    },
                    "Translation": {
                        "Text": "الخطة"
                    },
                    "Key": "TabPlan"
                },
                {
                    "Source": {
                        "Text": "POWER SHARDS"
                    },
                    "Translation": {
                        "Text": "شظايا الطاقة"
                    },
                    "Key": "BalanceAugmentShards"
                },
                {
                    "Source": {
                        "Text": "PRODUCED ELSEWHERE · this item is made somewhere in your factory, but no belt or pipe route reaches this line. If a teleporter, portal or loader feeds it, that link cannot be followed"
                    },
                    "Translation": {
                        "Text": "يُنتَج في مكان آخر · يُصنع هذا العنصر في مكان ما داخل مصنعك، لكن لا يوجد مسار ناقل أو أنبوب يصل إلى هذا الخط. وإذا كان يغذّيه ناقل آني أو بوابة أو مُحمّل، فلا يمكن تتبّع تلك الوصلة"
                    },
                    "Key": "BalanceProducedElsewhere"
                },
                {
                    "Source": {
                        "Text": "PRODUCER ISSUES · {0} missing input · {1} output blocked · {2} no power"
                    },
                    "Translation": {
                        "Text": "مشاكل في المنتجين · {0} بلا مدخل · {1} مخرج محجوب · {2} بلا طاقة"
                    },
                    "Key": "BalanceProducerIssueFmt"
                },
                {
                    "Source": {
                        "Text": "PRODUCERS"
                    },
                    "Translation": {
                        "Text": "المنتجون"
                    },
                    "Key": "BalanceProducersHeading"
                },
                {
                    "Source": {
                        "Text": "Pipe bottleneck: {0} → {1} carries {2} of {3}"
                    },
                    "Translation": {
                        "Text": "اختناق في الأنبوب: {0} → {1} ينقل {2} من {3}"
                    },
                    "Key": "LimiterPipeConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Producers have no power"
                    },
                    "Translation": {
                        "Text": "المنتجون بلا طاقة"
                    },
                    "Key": "BlockNoPower"
                },
                {
                    "Source": {
                        "Text": "Producing at {0}/min"
                    },
                    "Translation": {
                        "Text": "ينتج بمعدل {0}/دقيقة"
                    },
                    "Key": "TipRateFmt"
                },
                {
                    "Source": {
                        "Text": "Production exists, but none reaches the machines that need it"
                    },
                    "Translation": {
                        "Text": "الإنتاج موجود، لكن لا شيء منه يصل إلى الآلات التي تحتاجه"
                    },
                    "Key": "BlockSolvedNotConnected"
                },
                {
                    "Source": {
                        "Text": "READY - every remaining part is banked. Delivery is the only step left."
                    },
                    "Translation": {
                        "Text": "جاهز - كل جزء متبقٍ مُخزّن. لم يتبقّ سوى التسليم."
                    },
                    "Key": "VerdictReady"
                },
                {
                    "Source": {
                        "Text": "REFRESH"
                    },
                    "Translation": {
                        "Text": "تحديث"
                    },
                    "Key": "RefreshReport"
                },
                {
                    "Source": {
                        "Text": "Raw resource - extract it"
                    },
                    "Translation": {
                        "Text": "مورد خام - استخرجه"
                    },
                    "Key": "PlanRaw"
                },
                {
                    "Source": {
                        "Text": "Ready to deliver"
                    },
                    "Translation": {
                        "Text": "جاهز للتسليم"
                    },
                    "Key": "StatusReadyToDeliver"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - no purchasable research yet"
                    },
                    "Translation": {
                        "Text": "الوصفة مقفلة - لا يوجد بحث قابل للشراء بعد"
                    },
                    "Key": "GapNoUnlock"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - research: {0}"
                    },
                    "Translation": {
                        "Text": "الوصفة مقفلة - البحث: {0}"
                    },
                    "Key": "GapUnlockFmt"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - research: {0} ({1})"
                    },
                    "Translation": {
                        "Text": "الوصفة مقفلة - البحث: {0} ({1})"
                    },
                    "Key": "GapUnlockSrcFmt"
                },
                {
                    "Source": {
                        "Text": "Recipe not researched"
                    },
                    "Translation": {
                        "Text": "لم تُبحث الوصفة بعد"
                    },
                    "Key": "StatusRecipeLocked"
                },
                {
                    "Source": {
                        "Text": "Recipe not researched"
                    },
                    "Translation": {
                        "Text": "لم تُبحث الوصفة بعد"
                    },
                    "Key": "PlanLocked"
                },
                {
                    "Source": {
                        "Text": "Research needed upstream"
                    },
                    "Translation": {
                        "Text": "مطلوب بحث في مرحلة سابقة"
                    },
                    "Key": "SectionResearch"
                },
                {
                    "Source": {
                        "Text": "Research: {0}"
                    },
                    "Translation": {
                        "Text": "البحث: {0}"
                    },
                    "Key": "StatusResearchFmt"
                },
                {
                    "Source": {
                        "Text": "Reserve line (standby)"
                    },
                    "Translation": {
                        "Text": "خط احتياطي (استعداد)"
                    },
                    "Key": "StatusStandbyReserve"
                },
                {
                    "Source": {
                        "Text": "Route not measured"
                    },
                    "Translation": {
                        "Text": "لم يُقَس المسار"
                    },
                    "Key": "StatusRouteUnknown"
                },
                {
                    "Source": {
                        "Text": "SERVING CURRENT USE · consumers are using about {0} against {1} demand"
                    },
                    "Translation": {
                        "Text": "يغطي الاستهلاك الحالي · يستهلك المستهلكون نحو {0} مقابل طلب {1}"
                    },
                    "Key": "BalanceObservedUseHealthyFmt"
                },
                {
                    "Source": {
                        "Text": "SOMERSLOOPS"
                    },
                    "Translation": {
                        "Text": "SOMERSLOOPS"
                    },
                    "Key": "BalanceAugmentSloops"
                },
                {
                    "Source": {
                        "Text": "STALE - {0}s old (refresh failed)"
                    },
                    "Translation": {
                        "Text": "قديم - مضى عليه {0} ثانية (فشل التحديث)"
                    },
                    "Key": "AgeStaleFmt"
                },
                {
                    "Source": {
                        "Text": "STOCKPILING FOR YOUR OBJECTIVE · no machine draws this; you deliver it yourself"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceObjectiveStock"
                },
                {
                    "Source": {
                        "Text": "SUPPLY LINE  can send {0}  ·  actually arriving {1}"
                    },
                    "Translation": {
                        "Text": "خط الإمداد  يمكنه إرسال {0}  ·  الواصل فعليًا {1}"
                    },
                    "Key": "BalanceModelFmt"
                },
                {
                    "Source": {
                        "Text": "SUPPLY MEETS NEED · {0} is reaching consumers; they need {1}"
                    },
                    "Translation": {
                        "Text": "الإمداد يلبّي الحاجة · يصل {0} إلى المستهلكين؛ وهم يحتاجون {1}"
                    },
                    "Key": "BalanceModeledHealthyFmt"
                },
                {
                    "Source": {
                        "Text": "Saturated (surplus)"
                    },
                    "Translation": {
                        "Text": "مُشبَع (فائض)"
                    },
                    "Key": "StatusSaturated"
                },
                {
                    "Source": {
                        "Text": "Search items or buildings, then press Enter"
                    },
                    "Translation": {
                        "Text": "ابحث عن عناصر أو مبانٍ، ثم اضغط Enter"
                    },
                    "Key": "BalanceFilterHint"
                },
                {
                    "Source": {
                        "Text": "Separate track:"
                    },
                    "Translation": {
                        "Text": "مسار منفصل:"
                    },
                    "Key": "PlanExcludedLead"
                },
                {
                    "Source": {
                        "Text": "Showing the {0} lines needing the most attention, of {1} feeding your objective. Search, or filter by problem, to narrow this down."
                    },
                    "Translation": {
                        "Text": "يتم عرض {0} من الخطوط الأكثر حاجة للانتباه، من أصل {1} تغذّي هدفك. ابحث أو صفّ حسب المشكلة لتضييق النتائج."
                    },
                    "Key": "BalanceRowsTruncatedFmt"
                },
                {
                    "Source": {
                        "Text": "Showing the {0} lines needing the most attention, of {1} matching your filter."
                    },
                    "Translation": {
                        "Text": "يتم عرض {0} من الخطوط الأكثر حاجة للانتباه، من أصل {1} تطابق مرشّحك."
                    },
                    "Key": "BalanceRowsTruncatedFilteredFmt"
                },
                {
                    "Source": {
                        "Text": "Showing {0} of {1} - the rest are counted in the totals above but not listed."
                    },
                    "Translation": {
                        "Text": "يتم عرض {0} من {1} - الباقي محسوب في الإجماليات أعلاه لكنه غير مدرج."
                    },
                    "Key": "BalanceEndpointsTruncatedFmt"
                },
                {
                    "Source": {
                        "Text": "Spent fuel - burn {0} in a Nuclear Power Plant"
                    },
                    "Translation": {
                        "Text": "وقود مستهلك - احرق {0} في محطة طاقة نووية"
                    },
                    "Key": "PlanSpentFuelFmt"
                },
                {
                    "Source": {
                        "Text": "Starved - the delivery path could not be fully checked; inspect its connections"
                    },
                    "Translation": {
                        "Text": "بلا تغذية - تعذّر فحص مسار التسليم بالكامل؛ افحص توصيلاته"
                    },
                    "Key": "BlockConnectivityUnknown"
                },
                {
                    "Source": {
                        "Text": "Still needed: {0}  (banked {1}, to produce {2})"
                    },
                    "Translation": {
                        "Text": "ما زال مطلوبًا: {0}  (مُخزّن {1}، للإنتاج {2})"
                    },
                    "Key": "TipNeededFmt"
                },
                {
                    "Source": {
                        "Text": "Supply {0}/min vs demand {1}/min - add capacity"
                    },
                    "Translation": {
                        "Text": "الإمداد {0}/دقيقة مقابل طلب {1}/دقيقة - أضِف طاقة إنتاجية"
                    },
                    "Key": "BlockSupplyFmt"
                },
                {
                    "Source": {
                        "Text": "The feeding line could not be identified - inspect the connected producers"
                    },
                    "Translation": {
                        "Text": "تعذّر تحديد الخط المغذّي - افحص المنتجين المتصلين"
                    },
                    "Key": "BlockPathAttributionMissing"
                },
                {
                    "Source": {
                        "Text": "The host cannot send a report"
                    },
                    "Translation": {
                        "Text": "المضيف لا يستطيع إرسال تقرير"
                    },
                    "Key": "NoRelayHeadline"
                },
                {
                    "Source": {
                        "Text": "The host could not produce a report"
                    },
                    "Translation": {
                        "Text": "تعذّر على المضيف إنشاء تقرير"
                    },
                    "Key": "HostDeclinedHeadline"
                },
                {
                    "Source": {
                        "Text": "The machines can supply {0}, but only {1} reaches consumers; inspect the route between them"
                    },
                    "Translation": {
                        "Text": "يمكن للآلات توفير {0}، لكن {1} فقط يصل إلى المستهلكين؛ افحص المسار بينهما"
                    },
                    "Key": "LimiterRoutingConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "This client asked the host for a report, but the host is not running a version of Critical Path that can send one. Ask the host to update, or open the panel on the host."
                    },
                    "Translation": {
                        "Text": "طلب هذا العميل تقريرًا من المضيف، لكن المضيف لا يشغّل إصدارًا من Critical Path يستطيع إرساله. اطلب من المضيف التحديث، أو افتح اللوحة على المضيف."
                    },
                    "Key": "NoRelayDetail"
                },
                {
                    "Source": {
                        "Text": "This reading is out of date - press REFRESH"
                    },
                    "Translation": {
                        "Text": "هذه القراءة قديمة - اضغط تحديث"
                    },
                    "Key": "BlockLegacyLogistics"
                },
                {
                    "Source": {
                        "Text": "Time-limited"
                    },
                    "Translation": {
                        "Text": "محدود زمنيًا"
                    },
                    "Key": "StatusTimeLimited"
                },
                {
                    "Source": {
                        "Text": "To research {0}  ({1}):"
                    },
                    "Translation": {
                        "Text": "لبحث {0}  ({1}):"
                    },
                    "Key": "ResearchPlanHeadFmt"
                },
                {
                    "Source": {
                        "Text": "Transport route is known; vehicle throughput is not yet measured."
                    },
                    "Translation": {
                        "Text": "مسار النقل معروف؛ لكن إنتاجية المركبات لم تُقَس بعد."
                    },
                    "Key": "TransportTopologyOnly"
                },
                {
                    "Source": {
                        "Text": "Under-supplied"
                    },
                    "Translation": {
                        "Text": "إمداد غير كافٍ"
                    },
                    "Key": "StatusUnderSupplied"
                },
                {
                    "Source": {
                        "Text": "Unlocked by {0} - your SELECTED milestone: its payment progress is the Milestone column →"
                    },
                    "Translation": {
                        "Text": "يفتحه {0} - المعلم المحدّد لديك: تقدّم دفعه في عمود المعلم →"
                    },
                    "Key": "ResearchIsSelectedFmt"
                },
                {
                    "Source": {
                        "Text": "Vehicle route connected - delivery rate unknown because throughput is not yet measured"
                    },
                    "Translation": {
                        "Text": "مسار المركبات متصل - معدل التسليم مجهول لأن الإنتاجية لم تُقَس بعد"
                    },
                    "Key": "BlockTransportRateUnknown"
                },
                {
                    "Source": {
                        "Text": "blocked by {0} on the belt"
                    },
                    "Translation": {
                        "Text": "محجوب بـ {0} على الناقل"
                    },
                    "Key": "EndpointStateJammedFmt"
                },
                {
                    "Source": {
                        "Text": "buffer {0} {1}"
                    },
                    "Translation": {
                        "Text": "مخزون {0} {1}"
                    },
                    "Key": "EndpointBufferFmt"
                },
                {
                    "Source": {
                        "Text": "downstream node"
                    },
                    "Translation": {
                        "Text": "عقدة لاحقة"
                    },
                    "Key": "LimiterEdgeDownstreamFallback"
                },
                {
                    "Source": {
                        "Text": "from the host, earlier (latest request failed)"
                    },
                    "Translation": {
                        "Text": "من المضيف، سابقًا (فشل آخر طلب)"
                    },
                    "Key": "AgeHostStale"
                },
                {
                    "Source": {
                        "Text": "from the host, just now"
                    },
                    "Translation": {
                        "Text": "من المضيف، قبل قليل"
                    },
                    "Key": "AgeFromHost"
                },
                {
                    "Source": {
                        "Text": "hard drive"
                    },
                    "Translation": {
                        "Text": "قرص صلب"
                    },
                    "Key": "SrcHardDrive"
                },
                {
                    "Source": {
                        "Text": "idle - no fault reported"
                    },
                    "Translation": {
                        "Text": "خامل - لا يوجد عطل مُبلّغ عنه"
                    },
                    "Key": "EndpointStateIdle"
                },
                {
                    "Source": {
                        "Text": "is not in this plan - its recipe is not unlocked yet"
                    },
                    "Translation": {
                        "Text": "ليس ضمن هذه الخطة - وصفته غير مفتوحة بعد"
                    },
                    "Key": "PlanExcludedWhyUnknown"
                },
                {
                    "Source": {
                        "Text": "is not in this plan - its recipe unlocks with {0}"
                    },
                    "Translation": {
                        "Text": "ليس ضمن هذه الخطة - تُفتح وصفته مع {0}"
                    },
                    "Key": "PlanExcludedWhyFmt"
                },
                {
                    "Source": {
                        "Text": "items"
                    },
                    "Translation": {
                        "Text": "عناصر"
                    },
                    "Key": "BufferItems"
                },
                {
                    "Source": {
                        "Text": "items"
                    },
                    "Translation": {
                        "Text": "عناصر"
                    },
                    "Key": "EndpointBufferItems"
                },
                {
                    "Source": {
                        "Text": "items/min"
                    },
                    "Translation": {
                        "Text": "عناصر/دقيقة"
                    },
                    "Key": "BalanceSolidRateUnit"
                },
                {
                    "Source": {
                        "Text": "just now"
                    },
                    "Translation": {
                        "Text": "قبل قليل"
                    },
                    "Key": "AgeJustNowFlow"
                },
                {
                    "Source": {
                        "Text": "just now"
                    },
                    "Translation": {
                        "Text": "قبل قليل"
                    },
                    "Key": "AgeJustNow"
                },
                {
                    "Source": {
                        "Text": "machine"
                    },
                    "Translation": {
                        "Text": "آلة"
                    },
                    "Key": "LimiterMachineFallback"
                },
                {
                    "Source": {
                        "Text": "made by {0}  ·  used by {1}{2}"
                    },
                    "Translation": {
                        "Text": "يُنتجه {0}  ·  يستخدمه {1}{2}"
                    },
                    "Key": "BalanceIdentityFmt"
                },
                {
                    "Source": {
                        "Text": "milestone"
                    },
                    "Translation": {
                        "Text": "معلم"
                    },
                    "Key": "SrcMilestone"
                },
                {
                    "Source": {
                        "Text": "missing input"
                    },
                    "Translation": {
                        "Text": "مدخل مفقود"
                    },
                    "Key": "EndpointStateMissingInput"
                },
                {
                    "Source": {
                        "Text": "m³"
                    },
                    "Translation": {
                        "Text": "m³"
                    },
                    "Key": "EndpointBufferM3"
                },
                {
                    "Source": {
                        "Text": "m³"
                    },
                    "Translation": {
                        "Text": "m³"
                    },
                    "Key": "BufferM3"
                },
                {
                    "Source": {
                        "Text": "m³/min"
                    },
                    "Translation": {
                        "Text": "m³/min"
                    },
                    "Key": "BalanceFluidRateUnit"
                },
                {
                    "Source": {
                        "Text": "no connected consumer"
                    },
                    "Translation": {
                        "Text": "لا يوجد مستهلك متصل"
                    },
                    "Key": "BalanceNoConsumer"
                },
                {
                    "Source": {
                        "Text": "no data - {0}"
                    },
                    "Translation": {
                        "Text": "لا توجد بيانات - {0}"
                    },
                    "Key": "AgeErrorFmt"
                },
                {
                    "Source": {
                        "Text": "no power"
                    },
                    "Translation": {
                        "Text": "لا طاقة"
                    },
                    "Key": "EndpointStateNoPower"
                },
                {
                    "Source": {
                        "Text": "no producer"
                    },
                    "Translation": {
                        "Text": "لا يوجد منتج"
                    },
                    "Key": "BalanceNoProducer"
                },
                {
                    "Source": {
                        "Text": "output full (nothing taking it)"
                    },
                    "Translation": {
                        "Text": "المخرج ممتلئ (لا شيء يستقبله)"
                    },
                    "Key": "EndpointStateOutputBlocked"
                },
                {
                    "Source": {
                        "Text": "paused"
                    },
                    "Translation": {
                        "Text": "متوقف مؤقتًا"
                    },
                    "Key": "EndpointStatePaused"
                },
                {
                    "Source": {
                        "Text": "producing"
                    },
                    "Translation": {
                        "Text": "قيد الإنتاج"
                    },
                    "Key": "EndpointStateProducing"
                },
                {
                    "Source": {
                        "Text": "re-measuring..."
                    },
                    "Translation": {
                        "Text": "جارٍ إعادة القياس..."
                    },
                    "Key": "AgeRefreshing"
                },
                {
                    "Source": {
                        "Text": "state unavailable"
                    },
                    "Translation": {
                        "Text": "الحالة غير متاحة"
                    },
                    "Key": "EndpointStateUnavailable"
                },
                {
                    "Source": {
                        "Text": "the {0} elevator phase"
                    },
                    "Translation": {
                        "Text": "مرحلة المصعد {0}"
                    },
                    "Key": "PlanForPhaseFmt"
                },
                {
                    "Source": {
                        "Text": "the {0} milestone"
                    },
                    "Translation": {
                        "Text": "المعلم {0}"
                    },
                    "Key": "PlanForMilestoneFmt"
                },
                {
                    "Source": {
                        "Text": "unavailable here"
                    },
                    "Translation": {
                        "Text": "غير متاح هنا"
                    },
                    "Key": "AgeUnavailable"
                },
                {
                    "Source": {
                        "Text": "upstream node"
                    },
                    "Translation": {
                        "Text": "عقدة سابقة"
                    },
                    "Key": "LimiterEdgeUpstreamFallback"
                },
                {
                    "Source": {
                        "Text": "waiting on {0}"
                    },
                    "Translation": {
                        "Text": "في انتظار {0}"
                    },
                    "Key": "EndpointStateStarvedFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Add 1 average {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  أضِف {1} واحدًا متوسط الأداء → نحو {2} يصل إلى المستهلكين ({3}%)"
                    },
                    "Key": "LimiterExactMachineMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Alt recipes exist"
                    },
                    "Translation": {
                        "Text": "{0}  ·  توجد وصفات بديلة"
                    },
                    "Key": "PlanAltFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Spare capacity unavailable - one or more routes could not be fully measured"
                    },
                    "Translation": {
                        "Text": "{0}  ·  السعة الفائضة غير متاحة - تعذّر قياس مسار أو أكثر بالكامل"
                    },
                    "Key": "PlanGraftUnknownFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Spare {1}/min, needs {2}/min ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  فائض {1}/دقيقة، مطلوب {2}/دقيقة ({3}%)"
                    },
                    "Key": "PlanGraftRatioFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Stored buffer covers ~{1} min"
                    },
                    "Translation": {
                        "Text": "{0}  ·  المخزون يغطي نحو {1} دقيقة"
                    },
                    "Key": "LimiterBufferFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Stored buffer is dry"
                    },
                    "Translation": {
                        "Text": "{0}  ·  المخزون فارغ"
                    },
                    "Key": "LimiterBufferDryFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Upgrade this belt to {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  طوّر هذا الناقل إلى {1} → نحو {2} يصل إلى المستهلكين ({3}%)"
                    },
                    "Key": "LimiterExactBeltMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Upgrade this pipe to {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  طوّر هذا الأنبوب إلى {1} → نحو {2} يصل إلى المستهلكين ({3}%)"
                    },
                    "Key": "LimiterExactPipeMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  delivery rate unknown on {1} route(s)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  معدل التسليم مجهول في {1} مسار/مسارات"
                    },
                    "Key": "LimiterUnknownFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  line {1}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  الخط {1}"
                    },
                    "Key": "BalanceTitleMultiFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  more not shown"
                    },
                    "Translation": {
                        "Text": "{0}  ·  والمزيد غير معروض"
                    },
                    "Key": "PlanTruncFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  one more {1} would reach {2}%"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1} إضافي واحد يبلغ {2}%"
                    },
                    "Key": "LimiterMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  only {1} of {2} checked - too many to scan"
                    },
                    "Translation": {
                        "Text": "{0}  ·  فُحص {1} فقط من {2} - العدد أكبر من أن يُمسح"
                    },
                    "Key": "TruncFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1}"
                    },
                    "Key": "LimiterConstraintJoinFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1} checked - some supporting detail limited"
                    },
                    "Translation": {
                        "Text": "{0}  ·  فُحص {1} - بعض التفاصيل المساندة محدودة"
                    },
                    "Key": "TruncDetailFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1}: {2}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1}: {2}"
                    },
                    "Key": "VerdictPlanFaultFmt"
                },
                {
                    "Source": {
                        "Text": "{0} ({1})"
                    },
                    "Translation": {
                        "Text": "{0} ({1})"
                    },
                    "Key": "PlanUnlockNameFmt"
                },
                {
                    "Source": {
                        "Text": "{0} - {1}"
                    },
                    "Translation": {
                        "Text": "{0} - {1}"
                    },
                    "Key": "BalanceAnchorPingFmt"
                },
                {
                    "Source": {
                        "Text": "{0} - {1} - {2}"
                    },
                    "Translation": {
                        "Text": "{0} - {1} - {2}"
                    },
                    "Key": "BalanceEndpointPingFmt"
                },
                {
                    "Source": {
                        "Text": "{0} delivered"
                    },
                    "Translation": {
                        "Text": "تم تسليم {0}"
                    },
                    "Key": "SummaryDoneFmt"
                },
                {
                    "Source": {
                        "Text": "{0} delivered"
                    },
                    "Translation": {
                        "Text": "تم تسليم {0}"
                    },
                    "Key": "LedgerDeliveredFmt"
                },
                {
                    "Source": {
                        "Text": "{0} need a fix"
                    },
                    "Translation": {
                        "Text": "{0} تحتاج إصلاحًا"
                    },
                    "Key": "SummaryBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {0} banked  ·  {1}"
                    },
                    "Translation": {
                        "Text": "{0} مطلوب  ·  {0} مُخزّن  ·  {1}"
                    },
                    "Key": "LedgerBankedFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1}"
                    },
                    "Translation": {
                        "Text": "{0} مطلوب  ·  {1}"
                    },
                    "Key": "LedgerNoBankFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1} banked  ·  {2}"
                    },
                    "Translation": {
                        "Text": "{0} مطلوب  ·  {1} مُخزّن  ·  {2}"
                    },
                    "Key": "ResearchCostLedgerFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1} banked  ·  {2} to produce  ·  {3}"
                    },
                    "Translation": {
                        "Text": "{0} مطلوب  ·  {1} مُخزّن  ·  {2} للإنتاج  ·  {3}"
                    },
                    "Key": "LedgerFullFmt"
                },
                {
                    "Source": {
                        "Text": "{0} ready to deliver"
                    },
                    "Translation": {
                        "Text": "{0} جاهز للتسليم"
                    },
                    "Key": "SummaryReadyFmt"
                },
                {
                    "Source": {
                        "Text": "{0} still to build"
                    },
                    "Translation": {
                        "Text": "{0} متبقٍ للبناء"
                    },
                    "Key": "SummaryToBuildFmt"
                },
                {
                    "Source": {
                        "Text": "{0} {0}|plural(one=part,other=parts)"
                    },
                    "Translation": {
                        "Text": "{0} {0}|plural(zero=جزء,one=جزء,two=جزءان,few=أجزاء,many=جزءًا,other=جزء)"
                    },
                    "Key": "SummaryPartsFmt"
                },
                {
                    "Source": {
                        "Text": "{0} {1}"
                    },
                    "Translation": {
                        "Text": "{0} {1}"
                    },
                    "Key": "BalanceRateWithUnitFmt"
                },
                {
                    "Source": {
                        "Text": "{0}% productivity"
                    },
                    "Translation": {
                        "Text": "إنتاجية {0}%"
                    },
                    "Key": "EndpointProductivityFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Build:"
                    },
                    "Translation": {
                        "Text": "{0})  ابنِ:"
                    },
                    "Key": "PlanStepBuildFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Fix:"
                    },
                    "Translation": {
                        "Text": "{0})  أصلح:"
                    },
                    "Key": "PlanStepFixFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Unlock:"
                    },
                    "Translation": {
                        "Text": "{0})  افتح:"
                    },
                    "Key": "PlanStepUnlockFmt"
                },
                {
                    "Source": {
                        "Text": "{0}. {1} - {2}"
                    },
                    "Translation": {
                        "Text": "{0}. {1} - {2}"
                    },
                    "Key": "BalanceEndpointFmt"
                },
                {
                    "Source": {
                        "Text": "~{0} min remaining"
                    },
                    "Translation": {
                        "Text": "يتبقّى نحو {0} دقيقة"
                    },
                    "Key": "StatusEtaFmt"
                },
                {
                    "Source": {
                        "Text": "→ for {0}"
                    },
                    "Translation": {
                        "Text": "→ من أجل {0}"
                    },
                    "Key": "PlanItemForFmt"
                },
                {
                    "Source": {
                        "Text": "→ makes {0} buildable"
                    },
                    "Translation": {
                        "Text": "→ يتيح بناء {0}"
                    },
                    "Key": "PlanUnlockMakesFmt"
                },
                {
                    "Source": {
                        "Text": "▼"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceExpandChevron"
                }
            ]
        }
    ]
}